In [3]:
pip install pandas

Requirement already satisfied: pandas in ./data/lib/python3.10/site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.22.4 in ./data/lib/python3.10/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./data/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./data/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in ./data/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in ./data/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as panda
import numpy as np

In [7]:
values = np.array([1, 4, 7, 8, 5])
value = panda.Series(values)

In [8]:
value

0    1
1    4
2    7
3    8
4    5
dtype: int64

In [9]:
values

array([1, 4, 7, 8, 5])

In [12]:
dic = {"name" : "moyin",
        "color" : "blue",
        "religion" : "christian",
        "gender" : "female"}
dict = panda.Series(dic)

In [13]:
dict

name            moyin
color            blue
religion    christian
gender         female
dtype: object

In [16]:
sub = np.array(["Mathematics", "Chemistry", "Physics", "History"])
grades = np.array([40, 20, 100, 49])
sub_grade = panda.Series(grades, index=sub)

In [21]:
sub_grade

Mathematics     40
Chemistry       20
Physics        100
History         49
dtype: int64

In [32]:
mathematics = {"Isaac" : 78, "Moyinoluwa" : 100, "Kevin" : 90, "Grace" : "95"}
Grades = panda.Series(mathematics)
Grades[0:3]

Isaac          78
Moyinoluwa    100
Kevin          90
dtype: object

In [27]:
mathematics_grades = panda.Series(mathematics, index=Grades)

In [39]:
data = [['Alex', 10],['Bob',12], ['Clarke', 13]]
df = panda.DataFrame(data, columns = ['Name', 'Age'])

In [37]:
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [56]:
frame = [
         ['Name', 'Moyo'], ['Subject', 'Mathe'], ['Gender', 'Female'], ['Score', '90'], ['Exam_Type', 'Theory'],
         ['Name', 'Moyin'], ['Subject', 'English'], ['Gender', 'Male'], ['Score', '70'], ['Exam_Type', 'Pratical'],
         ['Name', 'Mofe'], ['Subject', 'Chemistry'], ['Gender', 'Male'], ['Score', '20'], ['Exam_Type', 'Pratical'],
         ['Name', 'Mope'], ['Subject', 'Physics'], ['Gender', 'Female'], ['Score', '840'], ['Exam_Type', 'Option'],
         ['Name', 'Mosun'], ['Subject', 'History'], ['Gender', 'Female'], ['Score', '100'], ['Exam_Type', 'Option'],
        ]
dataF = panda.DataFrame(frame, columns = ['Score', 'Exam_Type'])

In [57]:
dataF

        Score  Exam_Type
0        Name       Moyo
1     Subject      Mathe
2      Gender     Female
3       Score         90
4   Exam_Type     Theory
5        Name      Moyin
6     Subject    English
7      Gender       Male
8       Score         70
9   Exam_Type   Pratical
10       Name       Mofe
11    Subject  Chemistry
12     Gender       Male
13      Score         20
14  Exam_Type   Pratical
15       Name       Mope
16    Subject    Physics
17     Gender     Female
18      Score        840
19  Exam_Type     Option
20       Name      Mosun
21    Subject    History
22     Gender     Female
23      Score        100
24  Exam_Type     Option

In [68]:
dataF = panda.DataFrame(frame)
dataF.set_index(0, inplace=True)
result = result.transpose()
result = dataF.loc[['Score', 'Exam_Type']]
result

                  1
0
Score            90
Score            70
Score            20
Score           840
Score           100
Exam_Type    Theory
Exam_Type  Pratical
Exam_Type  Pratical
Exam_Type    Option
Exam_Type    Option

In [69]:
import pandas as pd
import numpy as np

In [70]:
df_drug = pd.read_csv('drug_consumption.csv')
df_drug.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1885 entries, 0 to 1884
Data columns (total 32 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         1885 non-null   int64
 1   Age        1885 non-null   float64
 2   Gender     1885 non-null   float64
 3   Education  1885 non-null   float64
 4   Country    1885 non-null   float64
 5   Ethnicity  1885 non-null   float64
 6   Nscore     1885 non-null   float64
 7   Escore     1885 non-null   float64
 8   Oscore     1885 non-null   float64
 9   Ascore     1885 non-null   float64
 10  Cscore     1885 non-null   float64
 11  Impulsive  1885 non-null   float64
 12  SS         1885 non-null   float64
 13  Alcohol    1885 non-null   object
 14  Amphet     1885 non-null   object
 15  Amyl       1885 non-null   object
 16  Benzos     1885 non-null   object
 17  Caff       1885 non-null   object
 18  Cannabis   1885 non-null   object
 19  Choc       1885 non-null   object
 20  Coke       1885 non-null   object
 21  Crack      1885 non-null   object
 22  Ecstasy    1885 non-null   object
 23  Heroin     1885 non-null   object
 24  Ketamine   1885 non-null   object
 25  Legalh     1885 non-null   object
 26  LSD        1885 non-null   object
 27  Meth       1885 non-null   object
 28  Mushrooms  1885 non-null   object
 29  Nicotine   1885 non-null   object
 30  Semer      1885 non-null   object
 31  VSA        1885 non-null   object
dtypes: float64(12), int64(1), object(19)
memory usage: 471.4+ KB

In [4]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in ./data/lib/python3.10/site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import mysql.connector as sql
import pandas as pd

In [6]:
host = "courses.csrrinzqubik.us-east-1.rds.amazonaws.com"
dt = sql.connect(host = host, port="3306", database ="tweater", user ="student", password ="datacamp")

db_cursor = dt.cursor()
db_cursor.execute('SELECT * FROM tweats')

table_rows = db_cursor.fetchall()
df = pd.DataFrame(table_rows)
df

    0  1                                                  2           3
0  75  3                      break egg. bake egg. eat egg.  2015-09-05
1  88  4          wash strawberries. add ice. blend. enjoy.  2015-09-14
2  77  6      2 slices of bread. add cheese. grill. heaven.  2015-09-21
3  87  5  open and crush avocado. add shrimps. perfect s...  2015-09-22
4  49  1  nachos. add tomato sauce, minced meat and chee...  2015-09-22
5  24  7             just eat an apple. simply and healthy.  2015-09-24

In [11]:
host = "car-simulation-station.c9az8e0qjbgo.us-east-1.rds.amazonaws.com"
data = sql.connect(host = host, port="3306", database ="car_simulation_station", user ="datacamp_user", password ="learn tabular data for fun and profit")

db_cursor = data.cursor()
db_cursor.execute('SELECT * FROM car_simulation_station')

table_rows = db_cursor.fetchall()
dataF = pd.DataFrame(table_rows)
dataF

DatabaseError: 2005 (HY000): Unknown MySQL server host 'car-simulation-station.c9az8e0qjbgo.us-east-1.rds.amazonaws.com' (-2)

In [1]:
pip install requests

Requirement already satisfied: requests in ./data/lib/python3.10/site-packages (2.31.0)
Requirement already satisfied: charset-normalizer<4,>=2 in ./data/lib/python3.10/site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in ./data/lib/python3.10/site-packages (from requests) (3.6)
Requirement already satisfied: urllib3<3,>=1.21.1 in ./data/lib/python3.10/site-packages (from requests) (2.2.1)
Requirement already satisfied: certifi>=2017.4.17 in ./data/lib/python3.10/site-packages (from requests) (2024.2.2)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import requests
import pandas as pd

In [8]:
response = requests.get("https://www.givefood.org.uk/api/2/foodbanks")
print(response.status_code)

food_json = response.json()
food_dataframe = pd.json_normalize(food_json)
food_dataframe.shape

food_dataframe.head()

200

,name,alt_name,slug,phone,secondary_phone,email,address,postcode,closed,country,...,charity.registration_id,charity.register_url,politics.parliamentary_constituency,politics.mp,politics.mp_party,politics.mp_parl_id,politics.ward,politics.district,politics.urls.self,politics.urls.html
0,Chiltern Food Bank,None,chiltern,01494775668,None,info@chiltern.foodbank.org.uk,71 Broadway\r\nChesham\r\nBuckinghamshire\r\nH...,HP5 1BX,False,England,...,1146699,https://register-of-charities.charitycommissio...,Chesham and Amersham,Sarah Green,Liberal Democrats,4918.0,Chess Valley,Buckinghamshire,https://www.givefood.org.uk/api/2/constituency...,https://www.givefood.org.uk/needs/in/constitue...
1,Barrow Food Bank,None,barrow,01229343436,None,projectmanager@barrowfoodbank.co.uk,Abbey Road Baptist Church\r\nAbbey Road\r\nBar...,LA13 9BD,False,England,...,1152753,https://register-of-charities.charitycommissio...,Barrow and Furness,Simon Fell,Conservative,4744.0,Ormsgill and Parkside,Westmorland and Furness,https://www.givefood.org.uk/api/2/constituency...,https://www.givefood.org.uk/needs/in/constitue...
2,Noor Food Bank,None,noor,None,None,hello@noorfoodbank.co.uk,Noor Hall\r\nNoor St\r\nPreston\r\nPR1 1QS,PR1 1QS,False,England,...,None,None,Preston,Mark Hendrick,Labour Co-operative,473.0,St Matthew's,Preston,https://www.givefood.org.uk/api/2/constituency...,https://www.givefood.org.uk/needs/in/constitue...
3,Bradford on Avon Food Bank,None,bradford-on-avon,01225920748,None,boacommunityhub@gmail.com,The Hub @ BA15\r\nChurch Street\r\nBradford on...,BA15 1LS,False,England,...,1160807,https://register-of-charities.charitycommissio...,Chippenham,Michelle Donelan,Conservative,4530.0,Bradford-on-Avon South,Wiltshire,https://www.givefood.org.uk/api/2/constituency...,https://www.givefood.org.uk/needs/in/constitue...
4,Lions Food Hub Food Bank,None,lions-food-hub,02077400503,None,lionsfoodhub@gmail.com,Millwall Community Trust\r\nBolina Road\r\nSE1...,SE16 3LD,False,England,...,None,None,"Lewisham, Deptford",Vicky Foxcroft,Labour,4491.0,New Cross Gate,Lewisham,https://www.givefood.org.uk/api/2/constituency...,https://www.givefood.org.uk/needs/in/constitue...